{"/about/":{"data":{"":"Even if I write “we” on the pages of this website, it really means me, Damir Rakhmaev, at least for now. If you’d like to see me, you can check out my YouTube channel.\nI’m a Learner, Engineer, Technopreneur. The Founder and CEO (😁) of a company named Damirche LLC. I had a successful career in tech as a Software Engineer, and I’ve built cool things in the past. But I always dreamed (knew?) that someday I’ll be building my own products to solve people’s problems. So, this is what I do now (and Til I Collapse 😎).\nThis website (damirche.com) showcases my products and helps people find them and solve their problems."},"title":"About"},"/blog/2024-05-07-myphone/":{"data":{"":"MyPhone is an app that allows you to stream your phone’s screen to your AR/VR headset. Check the link for details."},"title":"MyPhone is available!"},"/blog/2024-06-25-vlogmonitor/":{"data":{"":"VlogMonitor is an app that allows you to see yourself on iPad while filming on iPhone’s rear camera.\nCheck the link for details."},"title":"VlogMonitor is available!"},"/blog/2024-06-27-myphone-vision/":{"data":{"":"MyPhone Vision is an app that allows you to stream your phone’s screen to your Vision Pro.\nCheck the link for details."},"title":"MyPhone Vision is available!"},"/blog/how-to-mirror-iphone-to-ipad/":{"data":{"":"In this quick guide, you’ll learn how to mirror iPhone to iPad using the VlogMonitor app. Even as VlogMonitor is designed for vloggers who need lower latency, higher framerate, and quality, the app is perfectly good for “just” screen mirroring, though it might be a bit of overkill. 😎\nVlogMonitor is stupidly simple and easy to use. Honestly, you do not need to read this post because the app will guide you to the desired result. I designed it with simplicity in mind and worked really hard to optimize latency and quality. But let’s get started.","on-ipad#On iPad":" Open VlogMonitor Tap Watch Tap Search for Devices Allow Local Network Access if asked.\nSelect your iPhone That’s it! At this point, you’ll see your iPhone’s screen.\nSee all VlogMonitor guides","on-iphone#On iPhone":" Open VlogMonitor Tap Record Tap Start Streaming Select Start Broadcast Allow Local Network Access if asked.\nStreaming will start in a few seconds."},"title":"How to Mirror iPhone to iPad? [2025 Full Guide]"},"/blog/how-to-mirror-iphone-to-iphone/":{"data":{"":"In this quick guide, you’ll learn how to screen share iPhone to iPhone using the VlogMonitor app. Use this link to see all VlogMonitor guides.\nLet’s get started.","on-receiving-iphone#On receiving iPhone":" Open VlogMonitor Tap Watch Tap Search for Devices Allow Local Network Access if asked.\nSelect your iPhone That’s it! At this point, you’ll see your iPhone’s screen.\nSee all VlogMonitor guides","on-sending-iphone#On sending iPhone":" Open VlogMonitor Tap Record Tap Start Streaming Select Start Broadcast Allow Local Network Access if asked.\nStreaming will start in a few seconds."},"title":"How to Mirror iPhone to iPhone? [2025 Full Guide]"},"/blog/use-your-ipad-as-selfie-mirror/":{"data":{"":"Do you consider getting yourself a mirror for selfies? Or maybe you already have one, and it is not exactly what you want because you want to put yourself precisely into the frame. In this case, VlogMonitor might be the solution you want."},"title":"Use iPad as a Selfie Mirror?"},"/contact/":{"data":{"":"If you have any questions or would like to chat with us, don’t hesitate to get in touch with us using the information below.\nEmail: rdamir@damirche.com"},"title":"Contact"},"/products/":{"data":{"":" VlogMonitor: Boss Level SelfisNo-brainer for your best selfies, photos, and videos! MyPhone: Your Phone in VRUse this app to mirror your phone’s screen to AR/VR headsets BigScrubber for YouTubeVision Pro owners, no more misclicks on YouTube in Safari! Megafn = Amplifier × EffectsEnjoy transmuting voices! MyPhone VisionMirror your Android phone’s screen to Vision Pro "},"title":"Products"},"/products/bigscrubber/":{"data":{"":"","#":" Fix Your YouTube Experience\nNo More Misclicks on YouTube in Safari!\nScreenshots Description BigScrubber is a Safari extension that fixes our YouTube experience.\nHere’s how:\nIt makes the Play/Pause and Fullscreen buttons larger, so we won’t misclick anymore. It increases the spacing between the scrubber and the buttons panel, preventing accidental jumps to the start or end of the video when pausing or going fullscreen. And finally, it makes the scrubber thumb on YouTube/YouTubeTV in Safari 5x+ bigger, making it easier to grab with precision. I built it because I was so frustrated with constant misclicks that I wanted to slam my AVP on the floor.\nHow to get it? "},"title":"BigScrubber"},"/products/bigscrubber/support/":{"data":{"":"For any questions, suggestions, or bug reports, email us: rdamir@damirche.com"},"title":"Support"},"/products/megafn/":{"data":{"":"","#":" Enjoy transmuting voices!\nHave a blast transforming the voices of friends, family, dogs, puppies, cats, kittens, and yourself!\nScreenshots Description Have a blast transforming the voices of friends, family, dogs, puppies, cats, kittens, and yourself!\nMegafn lets you:\nEntertain yourself and your friends with hilarious, transformed, weird-sounding voices. Tease your friends, schoolmates, family—or even strangers—with super high-pitched or ultra low-pitched voices. Got dogs? Tease them, too! Do you think they’ll get confused? Ever wondered if your doggo would sound like a wolf with a lower pitch? Find out! Curious if kittens can growl when their voices are lowered? Try it! Amplify your voice (or your kittens’!) for even more fun. Explore how your voice (or your puppy’s!) sounds with pitch changes of 1, 2, or 3 semitones—or shifts of 1/2, 3/4, 1, or 2 octaves. Unleash your creativity and discover endless ways to have fun. Share your experiments on social media! Make and share hilarious videos on TikTok to get more views. Let the world see how YOU have FUN with Megafn! Use the hashtag #megafn to share your joy on social media.\nHow to get it? "},"title":"Megafn"},"/products/megafn/support/":{"data":{"":"For any questions, suggestions, or bug reports, email us: rdamir@damirche.com"},"title":"Support"},"/products/myphone-vision/":{"data":{"":"","#":" Bring Your Phone into Vision\nMirror your Android phone’s screen to Vision Pro\nScreenshots Description Do you want to use your phone while wearing Vision Pro? So the screen is large enough to cover a whole wall in a room.\nThe app lets you do this. You can watch videos, scroll shorts, read articles, and even play games with low latency and high quality.\nAvailable for Vision Pro Available for iPhone and Android "},"title":"MyPhone Vision"},"/products/myphone-vision/support/":{"data":{"":"Join the Discord for any questions, suggestions, or bug reports.\nOr email us: rdamir@damirche.com"},"title":"Support"},"/products/myphone/":{"data":{"":"","#":" Bring Your Phone into VR (Quest 2/3/Pro/3S)\nUse this app to mirror your phone’s screen to AR/VR headsets\nPreview Video Screenshots Description MyPhone does not offer remote control over your phone, but it lets you see the phone’s screen in a big window instead of a blurry passthrough. Use it to check notifications, watch puppy or kitten videos, scroll Instagram or TikTok, read articles, and so on. I worked really hard to optimize latency and quality.\nAvailable for Quest 3 and Quest Pro Install via SideQuest or Join the Beta Test on App Lab\nAvailable for iPhone and Android "},"title":"MyPhone"},"/products/myphone/support/":{"data":{"":"Join the Discord for any questions, suggestions, or bug reports.\nOr email us: rdamir@damirche.com"},"title":"Support"},"/products/to-do-done/":{"data":{"":"Coming soon!"},"title":"To-do-Done"},"/products/to-do-done/support/":{"data":{"":"Join the Discord for any questions, suggestions, or bug reports.\nOr email us: rdamir@damirche.com"},"title":"Support"},"/products/vlogmonitor/":{"data":{"":"","#":" Selfie Finder For Main Camera\nNo-Brainer for Your Best Selfies, Photos, and Videos!\nScreenshots Description Do you love taking stunning selfies, photos, or videos? And maybe you want to make them all (a bit) envious :-)\nVideo Gain confidence in capturing top-quality videos on your iPhone using the main camera while seeing yourself on your iPad. The VlogMonitor makes this easy.\nPhoto Make the best selfies ever using the iPhone’s main camera. Skip endless retakes. Why? Because now you can see how you look in real-time on your iPad.\nAnd one more thing: You can use another iPhone, Mac, or Android phone instead of an iPad.\nFrom creators to creators, give it a try and see the difference!\nHow to get it? "},"title":"VlogMonitor"},"/products/vlogmonitor/faq/":{"data":{"":" Can I use other (non-standard) camera apps as well? Yes, you can use any camera app you like. Does VlogMonitor require the same Apple ID on both devices? No. But in this case, you’ll need to buy the app from both accounts because it is technically a different person’s account. Can I use it to screen mirror Netflix/Prime Video/HBO Max/etc? No. Streaming services like Netflix/Prime Video/HBO MaxNetflix/Prime Video/HBO Max/Disney+/Paramount+ and others use DRM to protect their content from copying. Unfortunately, DRM prevents us from being able to screen share this content. Can I control my iPhone from my iPad? No, you can’t. Instead, I use a Bluetooth remote to start/stop recording and shutter control. I got it with my tripod for free, so they should be pretty affordable. Can I use it on the field/outside? Or when traveling and not connected to Wi-Fi Yes, you can. Just enable Personal Hotspot and connect another device to it. Alternatively, you can wire devices with a USB-C cable. However, not all iPhone/iPad models support this, even if they are USB-C-capable. What if I have a problem or want a feature? Contact me, ideally via Discord. I work individually with each user until I help them to achieve what they want. "},"title":"FAQ"},"/products/vlogmonitor/guides/":{"data":{"":"VlogMonitor makes a lot of options for screen mirroring possible.\nHow to Screen Mirror iPhone to iPad\nHow to Screen Mirror iPhone to iPhone"},"title":"Guides and Tutorials"},"/products/vlogmonitor/screen-mirroring/":{"data":{"":"VlogMonitor app is based on screen mirroring technology. However, it was initially designed as a tool for content creators (YouTubers in particular). Allowing them to make better selfie photos and videos because of the ability to see themselves on iPad or Mac while filming with the iPhone’s main (rear) camera.\nBut because of its low latency, high image quality, and support of audio VlogMonitor quickly became popular for screen sharing from iPhone to iPad or Mac, mirroring from iPhone to Android, and screencasting from Android to iPhone/iPad/Mac/Android.\nCheck out our Guides and Tutorials to learn to use VlogMonitor for screen sharing."},"title":"Screen Mirroring"},"/products/vlogmonitor/support/":{"data":{"":"Join the Discord for any questions, suggestions, or bug reports.\nOr email us: rdamir@damirche.com"},"title":"Support"}}